---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicate
source: html/560b4bf9-8c85-7193-f63a-0e412e0e08f2.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CopyPasteFailures.CannotDuplicate Property

Elements can't be duplicated

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDuplicate { get; }
```